import type { TableData } from '../table-types';

export const FootyWC: TableData = {
    labels: ['1998', '2002', '2006', '2010', '2014', '2018', '2022'],
    data: [
        {
            k: 'Brazil',
            v: [2, 1, 0, 0, 0, 0, 0],
        },
        {
            k: 'Đức',
            v: [1, 2, 1, 1, 2, 0, 0],
        },
        {
            k: 'Ý',
            v: [0, 0, 2, 0, 0, 0, 0],
        },
        {
            k: 'Argentina',
            v: [0, 0, 0, 0, 1, 0, 2],
        },
        {
            k: 'Pháp',
            v: [1, 0, 1, 0, 0, 2, 1],
        },
        {
            k: 'Anh',
            v: [0, 0, 0, 0, 0, 1, 0],
        },
        {
            k: 'Tây Ban Nha',
            v: [0, 0, 0, 2, 0, 0, 0],
        },
        {
            k: 'Hà Lan',
            v: [0, 0, 0, 1, 1, 0, 0],
        },
        {
            k: 'Uruguay',
            v: [0, 0, 0, 1, 0, 0, 0],
        },
        {
            k: 'Croatia',
            v: [0, 0, 0, 0, 0, 1, 1],
        },
        {
            k: 'Khác',
            v: [0, 0, 0, 0, 0, 0, 0],
        },
    ],
};
