import type { AreaChartData } from '../table-types';

export const DatasetGdp: AreaChartData = {
    title: 'Bảng GDP các quốc gia (tỷ USD)',
    labels: [2010, 2012, 2014, 2016, 2018, 2020, 2022],
    datasets: [
        {
            label: 'Mỹ',
            data: [14964, 16255, 17521, 18624, 20580, 21138, 25463],
        },
        {
            label: 'Trung Quốc',
            data: [6087, 8532, 10482, 11232, 13608, 14723, 17963],
        },
        {
            label: 'Nhật Bản',
            data: [5700, 6203, 4850, 4939, 4971, 5050, 4231],
        },
        {
            label: 'Đức',
            data: [3400, 3537, 3884, 3479, 3996, 3846, 4061],
        },
        {
            label: 'Ấn Độ',
            data: [1700, 1827, 2039, 2290, 2713, 2626, 3386],
        },
        {
            label: 'Anh',
            data: [2400, 2660, 3060, 2690, 2850, 2707, 3120],
        },
        {
            label: 'Pháp',
            data: [2600, 2650, 2850, 2470, 2780, 2603, 2900],
        },
        {
            label: 'Brazil',
            data: [2200, 2460, 2450, 1795, 1870, 1445, 1860],
        },
        {
            label: 'Ý',
            data: [2100, 2070, 2140, 1850, 2080, 1887, 2100],
        },
        {
            label: 'Canada',
            data: [1600, 1820, 1790, 1530, 1710, 1643, 2050],
        },
        {
            label: 'Nga',
            data: [1500, 2010, 2050, 1280, 1650, 1483, 2200],
        },
        {
            label: 'Khác',
            data: [18000, 19000, 20000, 21000, 22000, 23000, 24000],
        },
    ],
};
